<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
body {
	background-image: url(Imagenes/aasdsad.jpg);
}
.style5 {color: #FFFFFF}
-->
</style></head>

<body>
<p class="style5"><img src="Imagenes/logo.jpg" alt="logo" width="88" height="59" /></p>
<p align="center" class="style5">El creador de PHP es Rasmus Lerdorf. Nacido en Groenlandia y criado en Dinamarca, Lerdorf comenz&oacute; a desarrollar PHP en 1994 como un conjunto de scripts CGI (Common Gateway Interface) escritos en C para rastrear las visitas a su curr&iacute;culum vitae en l&iacute;nea. A lo largo del tiempo, este conjunto de scripts evolucion&oacute; y se convirti&oacute; en el lenguaje de programaci&oacute;n del lado del servidor conocido como PHP que hoy en d&iacute;a es ampliamente utilizado en el desarrollo web.</p>
<p align="center" class="style5"><img src="Imagenes/paginaweb.jpg" alt="paginaweb" width="183" height="141" /></p>
<p align="center" class="style5"> PHP (acr&oacute;nimo recursivo que significa &quot;PHP: Hypertext Preprocessor&quot;) fue creado por Rasmus Lerdorf en 1994. Inicialmente, Lerdorf desarroll&oacute; PHP como un conjunto de scripts CGI (Common Gateway Interface) escritos en el lenguaje de programaci&oacute;n C para rastrear las visitas a su curr&iacute;culum vitae en l&iacute;nea. Con el tiempo, este conjunto de scripts evolucion&oacute; y se convirti&oacute; en un lenguaje de programaci&oacute;n del lado del servidor ampliamente utilizado para el desarrollo web din&aacute;mico.</p>
<p class="style5">PHP es un lenguaje de programaci&oacute;n de c&oacute;digo abierto y de prop&oacute;sito general que est&aacute; especialmente adaptado para el desarrollo web. Permite la creaci&oacute;n de sitios web din&aacute;micos al incrustar c&oacute;digo PHP en p&aacute;ginas HTML. Esto significa que puedes escribir c&oacute;digo PHP dentro de un archivo HTML para realizar tareas como conectar con bases de datos, generar contenido din&aacute;mico, procesar formularios, interactuar con el usuario y muchas otras cosas m&aacute;s.</p>
<p class="style5"></p>
<p class="style5">&nbsp;</p>
</body>
</html>
